[{
  "_id": {
    "$oid": "667a5fa227f834b9ef16451c"
  },
  "userId": "66774c7a345357f35045e83b",
  "caloriasObjetivo": 0,
  "dieta": "",
  "excluir": "",
  "meals": [
    {
      "id": 644854,
      "title": "Gluten Free Quinoa and Corn Flour Crepes",
      "readyInMinutes": 60,
      "servings": 4,
      "sourceUrl": "https://spoonacular.com/gluten-free-quinoa-and-corn-flour-crepes-644854",
      "instructions": [
        {
          "steps": [
            {
              "number": 1,
              "step": "Whisk the dry ingredients together in a bowl. In a separate bowl, whisk 2 1/2 cups hemp milk, flax seed mixture, maple syrup, and the melted coconut oil together."
            },
            {
              "number": 2,
              "step": "Add the wet ingredients to the dry ingredients and gently mix together. If the batter is too thick, add a few tablespoons of hemp milk at a time, up to 1/2 cup more hemp milk to make a pourable batter. (The batter should be thin enough to spread easily in the pan). Allow the batter rest in the refrigerator for at least 30 minutes."
            },
            {
              "number": 3,
              "step": "Heat an 8- or 10-inch nonstick skillet over medium heat."
            },
            {
              "number": 4,
              "step": "Add a small dab of virgin coconut oil for cooking."
            },
            {
              "number": 5,
              "step": "Pour about 1/2 cup batter into the skillet and at the same time, rotate the pan so the batter covers a thin layer on the bottom. Use small amounts of batter to repair any holes; work quickly and keep the crepe thin.Cook until the top of the crepe is dry, after about 1 minute, loosen the edges of the crepe from the pan with a spatula. Flip with your fingers or gently toss and flip (this may take a few attempts, but works best) and cook the other side for 30 to 60 seconds. Stack the cooked crepes on a plate. Keep them warm in a low oven or fill each crepe while it's in the pan, spooning the filling across the lower third of the crepe."
            },
            {
              "number": 6,
              "step": "Roll the crepe from the filling end or fold the bottom third over the filling, fold in the sides, then fold the crepe from the bottom up to make a pocket. Repeat the process, adding more coconut oil between crepes as needed, until all the batter is used up."
            }
          ]
        }
      ],
      "_id": {
        "$oid": "667a5fa227f834b9ef16451d"
      }
    },
    {
      "id": 653251,
      "title": "Noodles and Veggies With Peanut Sauce",
      "readyInMinutes": 30,
      "servings": 4,
      "sourceUrl": "https://spoonacular.com/noodles-and-veggies-with-peanut-sauce-653251",
      "instructions": [
        {
          "steps": [
            {
              "number": 1,
              "step": "Prep Time: 30 minutes"
            },
            {
              "number": 2,
              "step": "Cook spaghetti according to the package directions. Rinse the spaghetti with cold water and drain thoroughly."
            },
            {
              "number": 3,
              "step": "Pour into a large mixing bowl. Toss with the sesame oil.In a blender or food processor, combine the peanuts, garlic, soy sauce, vinegar, sugar, cayenne pepper, and water. Blend until smooth and set aside.Steam the carrots and the snow peas until tender-crisp, about 7 minutes, and set aside."
            },
            {
              "number": 4,
              "step": "Add the peanut sauce, carrots, and snowpeas to the bowl of spaghetti and toss.Just before serving, top with the green onions and cucumber.Can be served while warm or excellent as a chilled salad!"
            }
          ]
        }
      ],
      "_id": {
        "$oid": "667a5fa227f834b9ef16451e"
      }
    },
    {
      "id": 658269,
      "title": "Rice noodle salad with sesame oil dressing",
      "readyInMinutes": 45,
      "servings": 3,
      "sourceUrl": "https://spoonacular.com/rice-noodle-salad-with-sesame-oil-dressing-658269",
      "instructions": [
        {
          "steps": [
            {
              "number": 1,
              "step": "Cook the noodles as per instructions on the packet."
            },
            {
              "number": 2,
              "step": "Combine all the dressing ingredients in a bowl. Check for seasoning and salt as required."
            },
            {
              "number": 3,
              "step": "Add the carrot, spring onion, chilli and prawns to the dressing and mix well."
            },
            {
              "number": 4,
              "step": "Add the noodles and toss everything together."
            },
            {
              "number": 5,
              "step": "Sprinkle on the peanuts and serve."
            },
            {
              "number": 6,
              "step": "If you don't like the taste of raw spring onion, then stir fry it with the carrot and chilli for a couple of minutes and add it to the dressing :)"
            }
          ]
        }
      ],
      "_id": {
        "$oid": "667a5fa227f834b9ef16451f"
      }
    }
  ],
  "fecha": {
    "$date": "2024-06-25T06:11:46.121Z"
  },
  "__v": 0
}]